In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
path=r"C:\Users\mpmoh\Naresh IT\Visadataset - Visadataset.csv"
df=pd.read_csv(path)
df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

**Create a dataframes using list**

In [2]:
name=['Ramesh','Suresh','Satish']
age=[30,35,40]
name,age

(['Ramesh', 'Suresh', 'Satish'], [30, 35, 40])

In [4]:
data={'Name':['Ramesh','Suresh','Satish'],
     'Age':[30,35,40],
     'City':['Hyd','Blr','mumbai']}
pd.DataFrame(data)

     Name  Age    City
0  Ramesh   30     Hyd
1  Suresh   35     Blr
2  Satish   40  mumbai

step-1

create dataframe

In [5]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

step-2

provide data

In [6]:
pd.DataFrame(zip(name,age))

        0   1
0  Ramesh  30
1  Suresh  35
2  Satish  40

step-3

provide columns

In [8]:
data=zip(name,age)
cols=['Name','Age']
pd.DataFrame(data,columns=cols)

     Name  Age
0  Ramesh   30
1  Suresh   35
2  Satish   40

step-4

provide index

In [9]:
data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
pd.DataFrame(data,columns=cols,index=ind)

     Name  Age
A  Ramesh   30
B  Suresh   35
C  Satish   40

step-5

Add new column

In [ ]:
df['New column']

In [14]:

name=['Ramesh','Suresh','Satish']
age=[30,35,40]
data=zip(name,age)
cols=['Name','Age']
ind=['A','B','C']
df=pd.DataFrame(data,columns=cols,index=ind)
df

     Name  Age
A  Ramesh   30
B  Suresh   35
C  Satish   40

In [18]:
city_names=['Hyd','Blr','Mum']
df['City']=city_names
df

    Name  Age City
A    Seo   30  Hyd
B  missi   35  Blr
C  angel   40  Mum

step-6

In [19]:
df['Name']=['Seo','missi','angel']
df

    Name  Age City
A    Seo   30  Hyd
B  missi   35  Blr
C  angel   40  Mum

Step-7

drop column

In [20]:
df.drop('City',
       axis=1,
       inplace=True)

In [21]:
df

    Name  Age
A    Seo   30
B  missi   35
C  angel   40

step-8

drop rows

In [22]:
df.drop('B',axis=0,inplace=True)
df

    Name  Age
A    Seo   30
C  angel   40

step-9

save the dataframes

In [23]:
df.to_csv("output.csv")
df.to_excel("output.xlsx")

In [24]:
pd.read_csv("output.csv")

  Unnamed: 0   Name  Age
0          A    Seo   30
1          C  angel   40

step-10

remove the index

In [25]:
df.to_csv("output.csv",index=False)

In [26]:
pd.read_csv("output.csv")

    Name  Age
0    Seo   30
1  angel   40